@extends('layouts.master')

@section('title', 'About')

@section('before_container')
@endsection

@section('content')
<div class="container">
    <h1 id="title-page" class="text-center">About</h1>
    <hr>
    <img src="{{ asset('img/books.jpg') }}">
    <p>จากการศึกษาข้อมูลพบว่าการนำเสนอข้อมูลแบบไทม์ไลน์ (Timeline) มาเกือบ 300 ปีแล้ว โดยมีการใช้ครั้งแรกในปี ค.ศ. 1753 โดย Jacques Barbeu-Duborg ผู้เป็นทั้งล่ามแปลภาษาฝรั่งเศส, แพทย์ และคนสนิทของ Benjamin Franklin ได้ทำการสร้าง Chronological Chart ซึ่งถือว่าเป็นไทม์ไลน์สมัยใหม่ที่ถูกประดิษฐ์ขึ้นมาอันแรกในประวัติศาสตร์ โดยกระดาษข้างในที่เป็นไทม์ไลน์มีความยาว 54 ฟุต</p>
    <p>จาก Chronological Chart ที่กล่าวมาข้างต้นทำให้การนำเสนอข้อมูลในรูปแบบไทม์ไลน์ ถูกนำไปศึกษา วิจัย และประยุกต์ใช้ในการอธิบายข้อมูลหลากหลายชนิด นอกเหนือจากการใช้เพื่ออธิบายด้านประวัติศาสตร์  เช่น ข่าวสาร, การบังคับใช้กฏหมาย, การศึกษา, การแพทย์ เป็นต้น</p>
    <p>ในเวลาต่อมาเริ่มมีความชัดเจนจากเว็บไซต์สื่อต่างประเทศชั้นนำอย่าง TIME หรือ The New York Times ที่มีการนำเสนอข้อมูลและลำดับการเกิดขึ้นของเหตุการณ์สำคัญ ๆ ผ่าน ไทม์ไลน์มากขึ้น ทำให้ผู้ชมเว็บไซต์สามารถเข้าใจในข้อมูลที่นำเสนอได้ดียิ่งขึ้น และเห็นลำดับการเกิดเหตุการณ์ก่อน-หลังได้อย่างชัดเจน เช่น การกำเนิดทฤษฎี Higgs Boson หรือชีวประวัติ Nelson Mandela เป็นต้น </p>
    <p>แต่ก็พบข้อเท็จจริงประการหนึ่งว่าเว็บไซต์ที่กล่าวมาข้างต้น ยังไม่มีระบบที่รวบรวมไทม์ไลน์เพื่อให้เข้าถึงได้ง่าย รวมไปถึงระบบที่ผู้ใช้ทั่วไปสามารถสร้างไทม์ไลน์ได้ด้วยตนเอง ซึ่งในปัจจุบันยังไม่เป็นที่แพร่หลายมากนัก</p>
    <p>เราจึงต้องการสร้างระบบที่เปิดให้ผู้ใช้บุคคลทั่วไปสามารถสร้างไทม์ไลน์เพื่ออธิบายเหตุการณ์สำคัญ ๆ ที่มีความซับซ้อน ให้มีความน่าสนใจและข้อมูลที่จะนำเสนอสามารถเข้าใจได้ง่ายขึ้น ผู้ใช้สามารถแก้ไขไทม์ไลน์ได้ด้วยตนเอง และนำไทม์ไลน์ที่มีอยู่บนระบบไปแบ่งปันหรือเผยแพร่ให้ผู้อื่นได้ โดยการศึกษาจากระบบสร้างไทม์ไลน์ ที่มีอยู่เดิมแล้วมาประกอบด้วย</p>
    <p></p>
</div>
@endsection
